
# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# *Пример:*

# - [2, 3, 4, 5, 6] =>[12,15,16]      ([2*6, 3*5, 4*4]);
# - [2, 3, 5, 6] => [12,15]   ( [2*6, 3*5]) 

import random
from operator import length_hint
a= [random.randint(2, 9) for i in range(random.randint(1, 7))]
print(f'\nСписок = {a} => {[(a[i]*a[-i-1]) for i in range((len(a)//2)+1)]}') # При списке из двух элиментов умножает два раза...
