
# Задайте список из нескольких чисел. Напишите программу, 
# которая найдёт сумму элементов списка, стоящих на нечётной позиции.

# *Пример:*

# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

import random
import math
a: int = [2, 3, 5, 9, 3]
# sum = 0
# rev = []
# for i in range(len(a)):
#     if i%2!=0:
#         sum += a[i]
#         rev.append(a[i])
        

# print(f"\n - {a} -> на нечетных позициях элементы {' и '.join(map(str, rev))}, ответ: {sum}\n")





